app/controllers/imaging_access_controller.rb

SELECT * FROM "computers" WHERE ("computers"."mac_address" = '324324') ORDER BY computers.id DESC LIMIT 1
---
  def prescript
    @macaddress = params[:id]
    computer = Computer.find_last_by_mac_address(@macaddress)

SELECT * FROM "computers" WHERE ("computers"."mac_address" = 'default') ORDER BY computers.id DESC LIMIT 1
---
  def postscript
    @macaddress = params[:id]
    computer = Computer.find_last_by_mac_address(@macaddress)