app/controllers/packages_controller.rb

  def index
    if params[:query]
      @packages = Package.search(params[:query])
---
SELECT * FROM "packages"

  def show
    @package = Package.find(params[:id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 2)

  def edit
    @package = Package.find(params[:id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 2)

  def update
    @package = Package.find(params[:id])

    respond_to do |format|
      if @package.update_attributes(params[:package])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 6)
UPDATE "packages" SET "licensed" = 'f', "updated_at" = '2009-04-16 17:24:40' WHERE "id" = 6