app/controllers/package_test_reactions_controller.rb

SELECT * FROM "package_test_reactions" WHERE ("package_test_reactions"."id" = 1)
---
  def show
    @package = PackageTestReaction.find(params[:id])

SELECT * FROM "package_test_reactions" WHERE ("package_test_reactions"."id" = 1)
---
  def edit
    @package_test_reaction = PackageTestReaction.find(params[:id])

SELECT * FROM "package_test_reactions" WHERE ("package_test_reactions"."id" = 1)
---
  def update
    @package_test_reaction = PackageTestReaction.find(params[:id])

SELECT * FROM "package_test_reactions" WHERE ("package_test_reactions"."id" = 3)
DELETE FROM "package_test_reactions" WHERE "id" = 3
---
  def destroy
    @package_test_reaction = PackageTestReaction.find(params[:id])
    @package_test_reaction.destroy