app/controllers/package_tests_controller.rb

  def show
    @package_test = PackageTest.find(params[:id])
---
SELECT * FROM "package_tests" WHERE ("package_tests"."id" = 1)

  def edit
    @package_test = PackageTest.find(params[:id])
---
SELECT * FROM "package_tests" WHERE ("package_tests"."id" = 2)

  def create
    @package_test = PackageTest.new(params[:package_test])
    @package_test.package_id = @package.id
    respond_to do |format|
      if @package_test.save
---
INSERT INTO "package_tests" ("name", "updated_at", "description", "rule_type", "package_id", "rule_parameter", "success_value", "created_at") VALUES(NULL, '2009-04-10 13:52:33', NULL, NULL, NULL, NULL, NULL, '2009-04-10 13:52:33')

  def update
    @package_test = PackageTest.find(params[:id])

    respond_to do |format|
      if @package_test.update_attributes(params[:package_test])
---
SELECT * FROM "package_tests" WHERE ("package_tests"."id" = 2)
UPDATE "package_tests" SET "description" = 'Succeeds if Live Update process is not running. For testing if Symantec Antivirus Installation is complete.', "updated_at" = '2009-04-10 14:19:53' WHERE "id" = 2